STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE_Thread/BLE_HeartRate_Thread_FreeRTOS/Core/Src/app_entry.c
    /* USER CODE BEGIN vPortSuppressTicksAndSleep */

    /* USER CODE END vPortSuppressTicksAndSleep */
  }
  return;
}
#else
void vPortSuppressTicksAndSleep( uint32_t xExpectedIdleTime )
{
  return;
}
#endif /* ( CFG_LPM_LEVEL != 0) */

/**
 * @brief Function Assert AEABI in case of not described on 'libc' libraries.
 */
__WEAK void __aeabi_assert(const char * szExpression, const char * szFile, int iLine)
{
  Error_Handler();
  __builtin_unreachable();
}

CRCCTRL_Cmd_Status_t CRCCTRL_MutexTake(void)
{
  osStatus_t os_status;
  CRCCTRL_Cmd_Status_t crc_status;
  /* USER CODE BEGIN CRCCTRL_MutexTake_0 */

  /* USER CODE END CRCCTRL_MutexTake_0 */
  if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
  {
    os_status = osMutexAcquire(crcCtrlMutex, osWaitForever);
  }
  else
  {
    /* If the scheduler is not running, we can assume that the mutex is available */
    os_status = osOK;
  }

  if(os_status != osOK)
  {
    crc_status = CRCCTRL_NOK;
  }
  else
  {
    crc_status = CRCCTRL_OK;
  }
  /* USER CODE BEGIN CRCCTRL_MutexTake_1 */

  /* USER CODE END CRCCTRL_MutexTake_1 */
  return crc_status;
}

CRCCTRL_Cmd_Status_t CRCCTRL_MutexRelease(void)
{
  osStatus_t os_status;
  CRCCTRL_Cmd_Status_t crc_status;
  /* USER CODE BEGIN CRCCTRL_MutexRelease_0 */

  /* USER CODE END CRCCTRL_MutexRelease_0 */
  if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
  {
    os_status = osMutexRelease(crcCtrlMutex);
  }
  else
  {
    /* If the scheduler is not running, we can assume that the mutex is available */
    os_status = osOK;
  }

  if(os_status != osOK)
  {
    crc_status = CRCCTRL_NOK;
  }
  else
  {
    crc_status = CRCCTRL_OK;
  }
  /* USER CODE BEGIN CRCCTRL_MutexRelease_1 */

  /* USER CODE END CRCCTRL_MutexRelease_1 */
  return crc_status;
}

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
ADCCTRL_Cmd_Status_t ADCCTRL_MutexTake(void)
{
  osStatus_t os_status;
  ADCCTRL_Cmd_Status_t adc_status;
  /* USER CODE BEGIN ADCCTRL_MutexTake_0 */

  /* USER CODE END ADCCTRL_MutexTake_0 */
  if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
  {
    os_status = osMutexAcquire(adcCtrlMutex, osWaitForever);
  }
  else
  {
    /* If the scheduler is not running, we can assume that the mutex is available */
    os_status = osOK;
  }

  if(os_status != osOK)
  {
    adc_status = ADCCTRL_NOK;
  }
  else
  {
    adc_status = ADCCTRL_OK;
  }
  /* USER CODE BEGIN ADCCTRL_MutexTake_1 */

  /* USER CODE END ADCCTRL_MutexTake_1 */
  return adc_status;
}

ADCCTRL_Cmd_Status_t ADCCTRL_MutexRelease(void)
{
  osStatus_t os_status;
  ADCCTRL_Cmd_Status_t adc_status;
  /* USER CODE BEGIN ADCCTRL_MutexRelease_0 */

  /* USER CODE END ADCCTRL_MutexRelease_0 */
  if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
  {
    os_status = osMutexRelease(adcCtrlMutex);
  }
  else
  {
    /* If the scheduler is not running, we can assume that the mutex is available */
    os_status = osOK;
  }

  if(os_status != osOK)
  {
    adc_status = ADCCTRL_NOK;
  }
  else
  {
    adc_status = ADCCTRL_OK;
  }
  /* USER CODE BEGIN ADCCTRL_MutexRelease_1 */

  /* USER CODE END ADCCTRL_MutexRelease_1 */
  return adc_status;
}
#endif /* USE_TEMPERATURE_BASED_RADIO_CALIBRATION */

#if (HAL_TICK_RTC == 1)
/* Overwrite HAL Tick functions to not use sysTick but RTC */
HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{
  if(TimerHalTick_Id.Callback == NULL)
  {
    /* Create an RTC based timer to trigger HAL tick increment */
    UTIL_TIMER_Create(&TimerHalTick_Id,
                      HAL_TICK_FREQ_100HZ,
                      UTIL_TIMER_PERIODIC,
                      &TimerHalTickCb, 0);
    uwTickFreq = HAL_TICK_FREQ_100HZ;
  }
  return HAL_OK;
}

void HAL_SuspendTick(void)
{
  UTIL_TIMER_Stop(&TimerHalTick_Id);
  return;
}

void HAL_ResumeTick(void)
{
  UTIL_TIMER_Start(&TimerHalTick_Id);
  return;
}

static void HAL_StartTick(void)
{
  UTIL_TIMER_StartWithPeriod(&TimerHalTick_Id, HAL_TICK_FREQ_100HZ);
  return;
}
#endif /* HAL_TICK_RTC */

int PKACTRL_MutexTake(void)
{
  int error = 0;
  osStatus_t os_status;

  /* Take the mutex */
  os_status = osMutexAcquire(PkaMutex,
                             osWaitForever);

  if(os_status != osOK)
  {
    error = -1; /* Error */
  }

  return error;
}

int PKACTRL_MutexRelease(void)
{
  int error = 0;
  osStatus_t os_status;

  /* Release the mutex */
  os_status = osMutexRelease(PkaMutex);

  if(os_status != osOK)
  {
    error = -1; /* Error */
  }

  return error;
}

int PKACTRL_TakeSemEndOfOperation(void)
{
  int error = 0;
  osStatus_t os_status;

#if (CFG_LPM_LEVEL != 0)
  /* Avoid going in low power during computation */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_PKA_OVR_IT, UTIL_LPM_SLEEP_MODE);
#endif /* (CFG_LPM_LEVEL != 0) */

  /* Take the semaphore */
  os_status = osSemaphoreAcquire(PkaEndOfOperationSemaphore,
                                 osWaitForever);

  if(os_status != osOK)
  {
    error = -1; /* Error */
  }

  return error;
}

int PKACTRL_ReleaseSemEndOfOperation(void)
{
  int error = 0;
  osStatus_t os_status;

  /* Release the semaphore */
  os_status = osSemaphoreRelease(PkaEndOfOperationSemaphore);

#if (CFG_LPM_LEVEL != 0)
  /* Restore low power */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_PKA_OVR_IT, UTIL_LPM_MAX_MODE);
#endif /* (CFG_LPM_LEVEL != 0) */

  if(os_status != osOK)
  {
    error = -1; /* Error */
  }

  return error;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
